<a href="https://colab.research.google.com/github/vpwz/ds1002-qnd8mu/blob/main/homework/week-13.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Homework - Week 13

Complete the following blocks as specified in the directions. Run each cell to return the desired output. Save your notebook back to your GitHub repository and submit the GitHub URL to your notebook for review.

## 1. Change Runtime to R (1 pt)

Change the runtime of this notebook to R. You can verify that you are running R by displaying the current version you are running. Run the cell below and show the output.

In [1]:
version

               _
platform       x86_64-pc-linux-gnu
arch           x86_64
os             linux-gnu
system         x86_64, linux-gnu
status
major          4
minor          3.2
year           2023
month          10
day            31
svn rev        85441
language       R
version.string R version 4.3.2 (2023-10-31)
nickname       Eye Holes

## 2. Create Vectors (2 pts)

Create two vectors in the cells below, according to the prompts given.

In [2]:
# create a vector with 7 integer values. Assign it to a variable named "my_integers"
my_integers <- c(1,2,3,4,5,6,7)

In [ ]:
var1 = 8
var2 = 4
var3 = 12
var4 = 25

# Using the variables given above, assign three new variables the following calculated values:
#
# 1. Your first variable should be assigned the calculated value of var2 divided by var1.
# 2. Your second variable should be assigned the calculated value of var2 cubed times var3.
# 3. Your third variable should be assigned the calculated value of var4 integer divided by var3.
#
# Next, create an array populated by your three variables. Assign the array to a new variable named "my_calculated_values"


firstVar <- var2/var1
secondVar <- var2^3 * 3
thirdVar <- var4%/%var3

arr <- c(firstVar,secondVar,thirdVar)

## 3. Vector Indexes (3 pts)

In the cell below, create a vector that starts with the integer 4, that increments by counts of 3 all the way to 28.

Assign the vector to a variable name.

In [10]:
#
vec <- seq(4,28,3)
vec

[1]  4  7 10 13 16 19 22 25 28

Next, show how to display this vector with the 3 index removed.

In [11]:
#
vec <- vec[-3]
vec

[1]  4  7 13 16 19 22 25 28

Finally, show how to delete the 4th, 5th, and 7th indexes from the vector and update the vector so they are forever removed from the vector.

Hint: there is a fairly simple way to do this in one line, such that you don't have to run a separate command for each removal.

In [12]:
#
removeThese <- c(4,5,7)
vec<- vec[-removeThese]
vec

[1]  4  7 13 22 28

## 4. Create a Data Frame (3 pts)

In the cell below create a data frame with 10 observations (rows) and 5 variables (columns) each. This data frame will describe some of your favorite musical performers. You can use real or fictitious data to populate your data frame.

Variables:
  - `artist` - Artist or band name
  - `category` - Rock, Pop, Country, Hip-hop, Jazz, Classical, Soul, Other. (Try to distribute your selections here)
  - `size` - (number of members, 1-?)
  - `start` - Debut year of artist.
  - `grammy` - Grammmy winner? `TRUE` | `FALSE`

First create vectors for each variable populated with your own performer data. Then create a data frame from these vectors (be sure to assign column names too) and assign it to a named variable such as `df`.

In [13]:
#
artist<- c("Picaso","Amosta","Frety","Nomat","Pollad","Baget","Aple","Bigsey","Mosta","Nolo")
category<- c("Rock","Country","Classical","Rock","Country","Rock","Soul","Jazz","Pop","Rock")
size<- c(1,2,3,4,5,6,7,8,9,10)
start<- c(2000,2001,2002,2003,2004,2005,2006,2007,2008,2009)
grammy<- c(TRUE, TRUE, FALSE, TRUE, FALSE, TRUE, TRUE, FALSE, FALSE, TRUE)

df <- data.frame(artist, category, size, start, grammy)
df

   artist category  size start grammy
1  Picaso Rock       1   2000   TRUE
2  Amosta Country    2   2001   TRUE
3  Frety  Classical  3   2002  FALSE
4  Nomat  Rock       4   2003   TRUE
5  Pollad Country    5   2004  FALSE
6  Baget  Rock       6   2005   TRUE
7  Aple   Soul       7   2006   TRUE
8  Bigsey Jazz       8   2007  FALSE
9  Mosta  Pop        9   2008  FALSE
10 Nolo   Rock      10   2009   TRUE

## 5. Filter/Query a Data Frame (2 pts)

Use the data frame you created above and show how to perform the following queries.

In [15]:
# Display the first 3 records and only the `artist`, `category` and `grammy` columns for each.
head(df[,c("artist","category","grammy")] ,3)

  artist category  grammy
1 Picaso Rock       TRUE
2 Amosta Country    TRUE
3 Frety  Classical FALSE

In [22]:
# Display the records for just one musical category, such as only Rock bands or only Hip-hop bands.
rock <- df[df$category == "Rock",]
rock

   artist category size start grammy
1  Picaso Rock      1   2000  TRUE
4  Nomat  Rock      4   2003  TRUE
6  Baget  Rock      6   2005  TRUE
10 Nolo   Rock     10   2009  TRUE

## Query a Data Frame using `tidyverse` (4 pts)

1. Show how to load the library.
2. Show how to glimpse basic features of the `starwars` data table.
3. Create a query using tidyverse that retrieves the following data:
    - Selects only these columns: `name`, `height`, `sex`, `species`.
    - Filters for all species that are NOT Human.
    - Arranges the resulting data in order by name.

Show your output in a data frame.

In [26]:
#
library(tidyverse)

glimpse(starwars)

data <- starwars %>%
        select(name, height,species)%>%
        filter(species != "Human") %>%
        arrange(name)

data

Rows: 87
Columns: 14
$ name       <chr> "Luke Skywalker", "C-3PO", "R2-D2", "Darth Vader", "Leia Or…
$ height     <int> 172, 167, 96, 202, 150, 178, 165, 97, 183, 182, 188, 180, 2…
$ mass       <dbl> 77.0, 75.0, 32.0, 136.0, 49.0, 120.0, 75.0, 32.0, 84.0, 77.…
$ hair_color <chr> "blond", NA, NA, "none", "brown", "brown, grey", "brown", N…
$ skin_color <chr> "fair", "gold", "white, blue", "white", "light", "light", "…
$ eye_color  <chr> "blue", "yellow", "red", "yellow", "brown", "blue", "blue",…
$ birth_year <dbl> 19.0, 112.0, 33.0, 41.9, 19.0, 52.0, 47.0, NA, 24.0, 57.0, …
$ sex        <chr> "male", "none", "none", "male", "female", "male", "female",…
$ gender     <chr> "masculine", "masculine", "masculine", "masculine", "femini…
$ homeworld  <chr> "Tatooine", "Tatooine", "Naboo", "Tatooine", "Alderaan", "T…
$ species    <chr> "Human", "Droid", "Droid", "Human", "Human", "Human", "Huma…
$ films      <list> <"The Empire Strikes Back", "Revenge of the Sith", "Return…
$ vehicles   <list> <"Snowspeeder", "Imperial Speeder Bike">, <>, <>, <>, "Imp…
$ starships  <list> <"X-wing", "Imperial shuttle">, <>, <>, "TIE Advanced x1",…

   name                  height species
1  Ackbar                180    Mon Calamari
2  Adi Gallia            184    Tholothian
3  Ayla Secura           178    Twi'lek
4  BB8                    NA    Droid
5  Barriss Offee         166    Mirialan
6  Ben Quadinaros        163    Toong
7  Bib Fortuna           180    Twi'lek
8  Bossk                 190    Trandoshan
9  C-3PO                 167    Droid
10 Chewbacca             228    Wookiee
11 Darth Maul            175    Zabrak
12 Dexter Jettster       198    Besalisk
13 Dud Bolt               94    Vulptereen
14 Eeth Koth             171    Zabrak
15 Gasgano               122    Xexto
16 Greedo                173    Rodian
17 Grievous              216    Kaleesh
18 IG-88                 200    Droid
19 Jabba Desilijic Tiure 175    Hutt
20 Jar Jar Binks         196    Gungan
21 Ki-Adi-Mundi          198    Cerean
22 Kit Fisto             196    Nautolan
23 Lama Su               229    Kaminoan
24 Luminara Unduli       170    Mirialan
25 Mas Amedda            196    Chagrian
26 Nien Nunb             160    Sullustan
27 Nute Gunray           191    Neimodian
28 Plo Koon              188    Kel Dor
29 Poggle the Lesser     183    Geonosian
30 R2-D2                  96    Droid
31 R4-P17                 96    Droid
32 R5-D4                  97    Droid
33 Ratts Tyerell          79    Aleena
34 Roos Tarpals          224    Gungan
35 Rugor Nass            206    Gungan
36 Saesee Tiin           188    Iktotchi
37 San Hill              191    Muun
38 Sebulba               112    Dug
39 Shaak Ti              178    Togruta
40 Tarfful               234    Wookiee
41 Taun We               213    Kaminoan
42 Tion Medon            206    Pau'an
43 Wat Tambor            193    Skakoan
44 Watto                 137    Toydarian
45 Wicket Systri Warrick  88    Ewok
46 Yarael Poof           264    Quermian
47 Yoda                   66    Yoda's species
48 Zam Wesell            168    Clawdite